Documents/ЛБ_УстановкаУсловийСхемыКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаУсловийСхемыКредитования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей</xr:Item>
				<xr:Item>InformationRegister.ЛБ_УсловияПредоставленияКредита</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТехническиеСтавки</xr:Item>
				<xr:Item>InformationRegister.ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЗалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВРасчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ссуда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УвеличениеСтоимостиЗалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТехническиеСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНачалаПрименения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_УсловияПредоставленияКредита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_УсловияПредоставленияКредита</Name>
			<Comment>Условия предоставления займа</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокЗалога</Name>
					<Comment>Срок залога</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Comment>Схема кредитования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Участвует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УвеличениеСтоимостиЗалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ТехническиеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ТехническиеСтавки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНачалаПрименения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_УстановкаУсловийСхемыКредитования/Ext/ObjectModule.bsl
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
		
	ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);
	
	Движения.ЛБ_УсловияПредоставленияКредита.Записывать = Истина;  
	Движение = Движения.ЛБ_УсловияПредоставленияКредита.Добавить(); 
	Движение.Период = Дата; 
	Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
	Движение.СрокЗалога = ЭтотОбъект.СрокЗалога;  
	
	Движения.ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.Записывать = Истина;  
	Движение = Движения.ЛБ_УчастиеВРасчетеСтатусовПоСистемеЛояльности.Добавить(); 
	Движение.Период = Дата; 
	Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
	Движение.Участвует = ЭтотОбъект.УчастиеВРасчетах;
	
	Движения.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.Записывать = Истина;  
	Если ЭтотОбъект.Ссуда.Количество() = 0 Тогда  
		Движение = Движения.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.Добавить();
		Движение.Период = Дата; 
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;;
		Движение.УвеличениеСтоимостиЗалога = 0;
	Иначе	
	    Для каждого Стр Из ЭтотОбъект.Ссуда Цикл  
			Движение = Движения.ЛБ_НастройкаУвеличенияЗалогаПоСтатусамЗалогодателей.Добавить();
			Движение.Период = Дата; 
			Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;;
			Движение.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
			Движение.УвеличениеСтоимостиЗалога = Стр.УвеличениеСтоимостиЗалога;
		Конеццикла;  
	КонецЕсли;	
	
	Движения.ЛБ_ТехническиеСтавки.Записывать = Истина;   
	Если ЭтотОбъект.ТехническиеСтавки.Количество() = 0 Тогда 
		Движение = Движения.ЛБ_ТехническиеСтавки.Добавить();
		Движение.Период = Дата; 
		Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования; 
		Движение.ДеньНачалаПрименения = 0;
		Движение.ПроцентнаяСтавка = 0;
	Иначе	
	    Для каждого Стр Из ЭтотОбъект.ТехническиеСтавки Цикл  
			Движение = Движения.ЛБ_ТехническиеСтавки.Добавить();
			Движение.Период = Дата; 
			Движение.СхемаКредитования = ЭтотОбъект.СхемаКредитования;
			Движение.ДеньНачалаПрименения = Стр.ДеньНачалаПрименения;
			Движение.ПроцентнаяСтавка = Стр.ПроцентнаяСтавка;
		Конеццикла;  
	КонецЕсли;	
		
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
	               |ГДЕ
	               |	ЛБ_ОперацияПоЗалогу.ТекущаяУстановкаУсловийПоСхемеКредитования = &Ссылка
	               |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ОбщегоНазначения.СообщитьПользователю("В базе есть документы выдачи займа, использующие условия установленные в документе. Отмена проведения и удаление документа запрещены.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()  

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);   
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка); 
		Запрос.УстановитьПараметр("СхемаКредитования", ЭтотОбъект.СхемаКредитования);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_УстановкаУсловийСхемыКредитования.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЛБ_УстановкаУсловийСхемыКредитования КАК ЛБ_УстановкаУсловийСхемыКредитования
		               |ГДЕ
		               |	ЛБ_УстановкаУсловийСхемыКредитования.Дата = &Дата
		               |	И ЛБ_УстановкаУсловийСхемыКредитования.Проведен = ИСТИНА
		               |	И ЛБ_УстановкаУсловийСхемыКредитования.СхемаКредитования = &СхемаКредитования
		               |	И НЕ ЛБ_УстановкаУсловийСхемыКредитования.Ссылка = &Ссылка";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначения.СообщитьПользователю("На дату документа уже есть установки по схеме кредитования " + СокрЛП(ЭтотОбъект.СхемаКредитования) + ".");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
